{"alerts":[{"description":"English(en-GB): An area of low pressure moving in from the southwest through Saturday night into Sunday will bring a band of precipitation across much of the UK. The forward edge of this is expected to fall as a transient band of snow which may bring accumulations over higher ground, before turn increasingly to rain from the south through the night. However, for some places in the north of this area, this band may become slow-moving and snow may persist into Sunday morning.  For much of the area, accumulations likely to be confined to elevations above 200m, with 2-5 cm possible, 5-10cm possible above 400m. These accumulations likely to begin melting with the onset of rain, although, during this transition freezing rain is possible giving icy conditions, mainly over higher ground. In the north, where the band of precipitation becomes slow-moving, similar accumulations are expected although this will not melt, with lying snow remaining through Sunday. For further details see https://www.metoffice.gov.uk/weather/warnings-and-advice/uk-warnings What to expect: Possible travel delays on roads stranding some vehicles and passengers; Possible delays or cancellations to air travel; Bus and train services may be delayed or cancelled, with some road closures and longer journey times possible; Untreated pavements and cycle paths might be impassable; A chance of injuries from slips and falls on icy surfaces; There is a small chance that power cuts will occur and other services, such as mobile phone coverage, may be affected.","effective_local":"2023-03-11T15:00:00","effective_utc":"2023-03-11T15:00:00","ends_local":"2023-03-12T06:00:00","ends_utc":"2023-03-12T06:00:00","expires_local":"2023-03-12T06:00:00","expires_utc":"2023-03-12T06:00:00","onset_local":"2023-03-11T15:00:00","onset_utc":"2023-03-11T15:00:00","regions":["Strathclyde,UK"],"severity":"Advisory","title":"Snow/Ice","uri":"https://meteoalarm.org?geocode=EMMA_ID:UK105"}],"city_name":"Glasgow","country_code":"GB","lat":55.8609,"lon":-4.2514,"state_code":"SCT","timezone":"Europe/London"}
